Return-Path: <linux-kselftest+bounces-21018-lists+linux-kselftest=lfdr.de@vger.kernel.org>
X-Original-To: lists+linux-kselftest@lfdr.de
Delivered-To: lists+linux-kselftest@lfdr.de
Received: from ny.mirrors.kernel.org (ny.mirrors.kernel.org [IPv6:2604:1380:45d1:ec00::1])
	by mail.lfdr.de (Postfix) with ESMTPS id 37F199B5564
	for <lists+linux-kselftest@lfdr.de>; Tue, 29 Oct 2024 22:58:53 +0100 (CET)
Received: from smtp.subspace.kernel.org (wormhole.subspace.kernel.org [52.25.139.140])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by ny.mirrors.kernel.org (Postfix) with ESMTPS id 4BDE51C21608
	for <lists+linux-kselftest@lfdr.de>; Tue, 29 Oct 2024 21:58:52 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id 22A8B20A5CC;
	Tue, 29 Oct 2024 21:58:46 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org;
	dkim=pass (2048-bit key) header.d=gmail.com header.i=@gmail.com header.b="HhcMxmpy"
X-Original-To: linux-kselftest@vger.kernel.org
Received: from mail-pf1-f182.google.com (mail-pf1-f182.google.com [209.85.210.182])
	(using TLSv1.2 with cipher ECDHE-RSA-AES128-GCM-SHA256 (128/128 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id 0FFA3206E92;
	Tue, 29 Oct 2024 21:58:41 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org; arc=none smtp.client-ip=209.85.210.182

> -                       BTF_TYPE_TAG_ENC(NAME_NTH(1), 1),                =
                       /* [2] */
> -                       BTF_TYPE_ENC(NAME_NTH(2), BTF_INFO_ENC(BTF_KIND_S=
TRUCT, 1, 1), 4),      /* [3] */
> +                       BTF_TYPE_ENC(NAME_NTH(2), BTF_INFO_ENC(BTF_KIND_S=
TRUCT, 1, 1), 4),      /* [1] */
>                         BTF_MEMBER_ENC(NAME_NTH(3), 2, BTF_MEMBER_OFFSET(=
0, 0)),
> +                       BTF_TYPE_TAG_ENC(NAME_NTH(1), 3),                =
                       /* [2] */
> +                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4),   =
                       /* [3] */
>                         BTF_END_RAW,
>                 },
>                 BTF_STR_SEC("\0tag1\0t\0m"),
> @@ -7861,10 +7856,10 @@ static struct btf_dedup_test dedup_tests[] =3D {
>         .expect =3D {
>                 .raw_types =3D {
>                         BTF_STRUCT_ENC(NAME_NTH(1), 1, 4),             /*=
 [1] */
> -                       BTF_MEMBER_ENC(NAME_NTH(2), 2, 0),
> -                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [2] */
> -                       BTF_PTR_ENC(1),                                /*=
 [3] */
> -                       BTF_TYPEDEF_ENC(NAME_NTH(3), 3),               /*=
 [4] */
> +                       BTF_MEMBER_ENC(NAME_NTH(2), 3, 0),
> +                       BTF_TYPEDEF_ENC(NAME_NTH(3), 4),               /*=
 [2] */
> +                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [3] */
> +                       BTF_PTR_ENC(1),                                /*=
 [4] */
>                         BTF_END_RAW,
>                 },
>                 BTF_STR_SEC("\0foo\0x\0foo_ptr"),
> @@ -7901,10 +7896,10 @@ static struct btf_dedup_test dedup_tests[] =3D {
>         .expect =3D {
>                 .raw_types =3D {
>                         BTF_UNION_ENC(NAME_NTH(1), 1, 4),              /*=
 [1] */
> -                       BTF_MEMBER_ENC(NAME_NTH(2), 2, 0),
> -                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [2] */
> -                       BTF_PTR_ENC(1),                                /*=
 [3] */
> -                       BTF_TYPEDEF_ENC(NAME_NTH(3), 3),               /*=
 [4] */
> +                       BTF_MEMBER_ENC(NAME_NTH(2), 3, 0),
> +                       BTF_TYPEDEF_ENC(NAME_NTH(3), 4),               /*=
 [2] */
> +                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [3] */
> +                       BTF_PTR_ENC(1),                                /*=
 [4] */
>                         BTF_END_RAW,
>                 },
>                 BTF_STR_SEC("\0foo\0x\0foo_ptr"),
> @@ -7940,14 +7935,12 @@ static struct btf_dedup_test dedup_tests[] =3D {
>         },
>         .expect =3D {
>                 .raw_types =3D {
> -                       /* CU 1 */
>                         BTF_STRUCT_ENC(NAME_NTH(1), 1, 4),             /*=
 [1] */
> -                       BTF_MEMBER_ENC(NAME_NTH(2), 2, 0),
> -                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [2] */
> -                       /* CU 2 */
> -                       BTF_FWD_ENC(NAME_NTH(3), 1),                   /*=
 [3] */
> -                       BTF_PTR_ENC(3),                                /*=
 [4] */
> -                       BTF_TYPEDEF_ENC(NAME_NTH(3), 4),               /*=
 [5] */
> +                       BTF_MEMBER_ENC(NAME_NTH(2), 4, 0),
> +                       BTF_FWD_ENC(NAME_NTH(3), 1),                   /*=
 [2] */
> +                       BTF_TYPEDEF_ENC(NAME_NTH(3), 5),               /*=
 [3] */
> +                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [4] */
> +                       BTF_PTR_ENC(2),                                /*=
 [5] */
>                         BTF_END_RAW,
>                 },
>                 BTF_STR_SEC("\0foo\0x\0foo_ptr"),
> @@ -7990,18 +7983,15 @@ static struct btf_dedup_test dedup_tests[] =3D {
>         },
>         .expect =3D {
>                 .raw_types =3D {
> -                       /* CU 1 */
>                         BTF_STRUCT_ENC(NAME_NTH(1), 1, 4),             /*=
 [1] */
> -                       BTF_MEMBER_ENC(NAME_NTH(2), 2, 0),
> -                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [2] */
> -                       /* CU 2 */
> -                       BTF_FWD_ENC(NAME_NTH(1), 0),                   /*=
 [3] */
> -                       BTF_PTR_ENC(3),                                /*=
 [4] */
> -                       BTF_TYPEDEF_ENC(NAME_NTH(4), 4),               /*=
 [5] */
> -                       /* CU 3 */
> -                       BTF_STRUCT_ENC(NAME_NTH(1), 2, 8),             /*=
 [6] */
> -                       BTF_MEMBER_ENC(NAME_NTH(2), 2, 0),
> -                       BTF_MEMBER_ENC(NAME_NTH(3), 2, 0),
> +                       BTF_MEMBER_ENC(NAME_NTH(2), 5, 0),
> +                       BTF_FWD_ENC(NAME_NTH(1), 0),                   /*=
 [2] */
> +                       BTF_STRUCT_ENC(NAME_NTH(1), 2, 8),             /*=
 [3] */
> +                       BTF_MEMBER_ENC(NAME_NTH(2), 5, 0),
> +                       BTF_MEMBER_ENC(NAME_NTH(3), 5, 0),
> +                       BTF_TYPEDEF_ENC(NAME_NTH(4), 6),               /*=
 [4] */
> +                       BTF_TYPE_INT_ENC(0, BTF_INT_SIGNED, 0, 32, 4), /*=
 [5] */
> +                       BTF_PTR_ENC(2),                                /*=
 [6] */
>                         BTF_END_RAW,
>                 },
>                 BTF_STR_SEC("\0foo\0x\0y\0foo_ptr"),
> diff --git a/tools/testing/selftests/bpf/prog_tests/btf_dedup_split.c b/t=
ools/testing/selftests/bpf/prog_tests/btf_dedup_split.c
> index d9024c7a892a..e50c290b2d8c 100644
> --- a/tools/testing/selftests/bpf/prog_tests/btf_dedup_split.c
> +++ b/tools/testing/selftests/bpf/prog_tests/btf_dedup_split.c
> @@ -311,18 +311,18 @@ static void test_split_struct_duped() {
>                 "[5] STRUCT 's1' size=3D16 vlen=3D2\n"
>                 "\t'f1' type_id=3D2 bits_offset=3D0\n"
>                 "\t'f2' type_id=3D4 bits_offset=3D64",
> -               "[6] PTR '(anon)' type_id=3D8",
> -               "[7] PTR '(anon)' type_id=3D9",
> -               "[8] STRUCT 's1' size=3D16 vlen=3D2\n"
> -               "\t'f1' type_id=3D6 bits_offset=3D0\n"
> -               "\t'f2' type_id=3D7 bits_offset=3D64",
> -               "[9] STRUCT 's2' size=3D40 vlen=3D4\n"
> -               "\t'f1' type_id=3D6 bits_offset=3D0\n"
> -               "\t'f2' type_id=3D7 bits_offset=3D64\n"
> +               "[6] STRUCT 's1' size=3D16 vlen=3D2\n"
> +               "\t'f1' type_id=3D9 bits_offset=3D0\n"
> +               "\t'f2' type_id=3D10 bits_offset=3D64",
> +               "[7] STRUCT 's2' size=3D40 vlen=3D4\n"
> +               "\t'f1' type_id=3D9 bits_offset=3D0\n"
> +               "\t'f2' type_id=3D10 bits_offset=3D64\n"
>                 "\t'f3' type_id=3D1 bits_offset=3D128\n"
> -               "\t'f4' type_id=3D8 bits_offset=3D192",
> -               "[10] STRUCT 's3' size=3D8 vlen=3D1\n"
> -               "\t'f1' type_id=3D7 bits_offset=3D0");
> +               "\t'f4' type_id=3D6 bits_offset=3D192",
> +               "[8] STRUCT 's3' size=3D8 vlen=3D1\n"
> +               "\t'f1' type_id=3D10 bits_offset=3D0",
> +               "[9] PTR '(anon)' type_id=3D6",
> +               "[10] PTR '(anon)' type_id=3D7");
>
>  cleanup:
>         btf__free(btf2);
> @@ -385,13 +385,13 @@ static void test_split_dup_struct_in_cu()
>
>         VALIDATE_RAW_BTF(
>                         btf1,
> -                       "[1] INT 'int' size=3D4 bits_offset=3D0 nr_bits=
=3D32 encoding=3DSIGNED",
> -                       "[2] STRUCT 's' size=3D8 vlen=3D2\n"
> -                       "\t'a' type_id=3D3 bits_offset=3D0\n"
> -                       "\t'b' type_id=3D3 bits_offset=3D0",
> -                       "[3] STRUCT '(anon)' size=3D8 vlen=3D2\n"
> -                       "\t'f1' type_id=3D1 bits_offset=3D0\n"
> -                       "\t'f2' type_id=3D1 bits_offset=3D32");
> +                       "[1] STRUCT '(anon)' size=3D8 vlen=3D2\n"
> +                       "\t'f1' type_id=3D2 bits_offset=3D0\n"
> +                       "\t'f2' type_id=3D2 bits_offset=3D32",
> +                       "[2] INT 'int' size=3D4 bits_offset=3D0 nr_bits=
=3D32 encoding=3DSIGNED",
> +                       "[3] STRUCT 's' size=3D8 vlen=3D2\n"
> +                       "\t'a' type_id=3D1 bits_offset=3D0\n"
> +                       "\t'b' type_id=3D1 bits_offset=3D0");
>
>         /* and add the same data on top of it */
>         btf2 =3D btf__new_empty_split(btf1);
> @@ -402,13 +402,13 @@ static void test_split_dup_struct_in_cu()
>
>         VALIDATE_RAW_BTF(
>                         btf2,
> -                       "[1] INT 'int' size=3D4 bits_offset=3D0 nr_bits=
=3D32 encoding=3DSIGNED",
> -                       "[2] STRUCT 's' size=3D8 vlen=3D2\n"
> -                       "\t'a' type_id=3D3 bits_offset=3D0\n"
> -                       "\t'b' type_id=3D3 bits_offset=3D0",
> -                       "[3] STRUCT '(anon)' size=3D8 vlen=3D2\n"
> -                       "\t'f1' type_id=3D1 bits_offset=3D0\n"
> -                       "\t'f2' type_id=3D1 bits_offset=3D32",
> +                       "[1] STRUCT '(anon)' size=3D8 vlen=3D2\n"
> +                       "\t'f1' type_id=3D2 bits_offset=3D0\n"
> +                       "\t'f2' type_id=3D2 bits_offset=3D32",
> +                       "[2] INT 'int' size=3D4 bits_offset=3D0 nr_bits=
=3D32 encoding=3DSIGNED",
> +                       "[3] STRUCT 's' size=3D8 vlen=3D2\n"
> +                       "\t'a' type_id=3D1 bits_offset=3D0\n"
> +                       "\t'b' type_id=3D1 bits_offset=3D0",
>                         "[4] INT 'int' size=3D4 bits_offset=3D0 nr_bits=
=3D32 encoding=3DSIGNED",
>                         "[5] STRUCT 's' size=3D8 vlen=3D2\n"
>                         "\t'a' type_id=3D6 bits_offset=3D0\n"
> @@ -427,13 +427,13 @@ static void test_split_dup_struct_in_cu()
>         /* after dedup it should match the original data */
>         VALIDATE_RAW_BTF(
>                         btf2,
> -                       "[1] INT 'int' size=3D4 bits_offset=3D0 nr_bits=
=3D32 encoding=3DSIGNED",
> -                       "[2] STRUCT 's' size=3D8 vlen=3D2\n"
> -                       "\t'a' type_id=3D3 bits_offset=3D0\n"
> -                       "\t'b' type_id=3D3 bits_offset=3D0",
> -                       "[3] STRUCT '(anon)' size=3D8 vlen=3D2\n"
> -                       "\t'f1' type_id=3D1 bits_offset=3D0\n"
> -                       "\t'f2' type_id=3D1 bits_offset=3D32");
> +                       "[1] STRUCT '(anon)' size=3D8 vlen=3D2\n"
> +                       "\t'f1' type_id=3D2 bits_offset=3D0\n"
> +                       "\t'f2' type_id=3D2 bits_offset=3D32",
> +                       "[2] INT 'int' size=3D4 bits_offset=3D0 nr_bits=
=3D32 encoding=3DSIGNED",
> +                       "[3] STRUCT 's' size=3D8 vlen=3D2\n"
> +                       "\t'a' type_id=3D1 bits_offset=3D0\n"
> +                       "\t'b' type_id=3D1 bits_offset=3D0");
>
>  cleanup:
>         btf__free(btf2);
> --
> 2.34.1
>

